Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N16A.atdf
            <signals>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="0" function="F" pad="PB18"/>
              <signal group="WO" index="0" function="F" pad="PC24"/>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="F" pad="PB19"/>
              <signal group="WO" index="1" function="F" pad="PC25"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="2" function="F" pad="PB20"/>
              <signal group="WO" index="2" function="F" pad="PB22"/>
              <signal group="WO" index="2" function="F" pad="PC26"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="3" function="F" pad="PB21"/>
              <signal group="WO" index="3" function="F" pad="PB23"/>
              <signal group="WO" index="3" function="F" pad="PC27"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PB16"/>
              <signal group="WO" index="4" function="F" pad="PC28"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PA27"/>
              <signal group="WO" index="5" function="F" pad="PB11"/>
              <signal group="WO" index="5" function="F" pad="PB17"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="6" function="F" pad="PA20"/>
              <signal group="WO" index="6" function="F" pad="PB12"/>
              <signal group="WO" index="6" function="F" pad="PB24"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
              <signal group="WO" index="7" function="F" pad="PA21"/>
              <signal group="WO" index="7" function="F" pad="PB13"/>
              <signal group="WO" index="7" function="F" pad="PB25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="14" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="15" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="16" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="17" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="18" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="22" caption="Index of Generic Clock"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.0.1">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42004400"/>
            <parameters>
              <param name="INSTANCE_ID" value="81"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.1.1">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
              <signal group="SOF_1KHZ" function="G" pad="PB22"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8" caption="Number of USB end points (obsolete)"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="6" caption="Index of Generic Clock"/>
              <param name="PIPE_NUM" value="0" caption="Number of USB pipes"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
