Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N16A.atdf
    <module name="PM" id="U2240" version="2.1.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="IORET" caption="I/O Retention" mask="0x4"/>
        </register>
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="PLCFG" offset="0x2" rw="RW" size="1" initval="0x00" caption="Performance Level Configuration">
          <bitfield name="PLSEL" caption="Performance Level Select" mask="0x3" values="PM_PLCFG__PLSEL"/>
          <bitfield name="PLDIS" caption="Performance Level Disable" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="PLRDY" caption="Performance Level Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0400" caption="Standby Configuration">
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for HMCRAMCHS" mask="0xC00" values="PM_STDBYCFG__BBIASHS"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHBx, and APBx clocks are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="5"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL1" caption="Performance Level 1" value="0x1"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_STDBYCFG__LINKPD">
        <value name="DEFAULT" caption="Power domains are not linked" value="0"/>
        <value name="PD01" caption="PD0 and PD1 power domains are linked" value="1"/>
        <value name="PD12" caption="PD1 and PD2 power domains are linked" value="2"/>
        <value name="PD012" caption="All power domains are linked" value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="All power domains switching is handled by hardware." value="0"/>
        <value name="PD0" caption="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." value="1"/>
        <value name="PD01" caption="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." value="2"/>
        <value name="PD012" caption="All power domains are forced ACTIVE." value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
      <value-group name="PM_STDBYCFG__BBIASHS">
        <value name="RETBB" caption="Retention Back Biasing mode" value="0"/>
        <value name="STDBYBB" caption="Standby Back Biasing mode" value="1"/>
        <value name="STDBYOFF" caption="Standby OFF mode" value="2"/>
        <value name="OFF" caption="Always OFF mode" value="3"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.1.1" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Select Peripheral Multiplexer" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x400000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing Template" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX Registers" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG Registers" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="Port Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="Port Event Action 0" mask="0x60" values="PORT_EVCTRL__EVACT0"/>
          <bitfield name="PORTEI0" caption="Port Event Enable Input 0" mask="0x80"/>
          <bitfield name="PID1" caption="Port Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="Port Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="Port Event Enable Input 1" mask="0x8000"/>
          <bitfield name="PID2" caption="Port Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="Port Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="Port Event Enable Input 2" mask="0x800000"/>
          <bitfield name="PID3" caption="Port Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="Port Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="Port Event Enable Input 3" mask="0x80000000"/>
        </register>
