Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.20/atdf/ATSAML22N16A.atdf
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAML22NC" caption="SAML22NC">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PB00"/>
      <pin position="A3" pad="PB30"/>
      <pin position="A4" pad="VSW"/>
      <pin position="A5" pad="VDDCORE"/>
      <pin position="A6" pad="PA27"/>
      <pin position="A7" pad="PC27"/>
      <pin position="A8" pad="PB23"/>
      <pin position="A9" pad="PB22"/>
      <pin position="A10" pad="PA25"/>
      <pin position="A11" pad="PA24"/>
      <pin position="B1" pad="PA01"/>
      <pin position="B2" pad="PB01"/>
      <pin position="B3" pad="PB02"/>
      <pin position="B4" pad="PA31"/>
      <pin position="B5" pad="PA30"/>
      <pin position="B6" pad="PC28"/>
      <pin position="B7" pad="PC26"/>
      <pin position="B8" pad="PC25"/>
      <pin position="B9" pad="PC24"/>
      <pin position="B10" pad="PA23"/>
      <pin position="B11" pad="PA22"/>
      <pin position="C1" pad="PC02"/>
      <pin position="C2" pad="PC01"/>
      <pin position="C3" pad="PB03"/>
      <pin position="C4" pad="PB31"/>
      <pin position="C5" pad="RESET_N"/>
      <pin position="C6" pad="GNDIO"/>
      <pin position="C8" pad="PB25"/>
      <pin position="C9" pad="PB24"/>
      <pin position="C10" pad="PA21"/>
      <pin position="C11" pad="PA20"/>
      <pin position="D1" pad="PA02"/>
      <pin position="D2" pad="PC03"/>
      <pin position="D3" pad="PC00"/>
      <pin position="D8" pad="VDDIO"/>
      <pin position="D9" pad="PB21"/>
      <pin position="D10" pad="PB19"/>
      <pin position="D11" pad="PB20"/>
      <pin position="E1" pad="PB04"/>
      <pin position="E2" pad="PA03"/>
      <pin position="E3" pad="GNDANA"/>
      <pin position="E10" pad="PB17"/>
      <pin position="E11" pad="PB18"/>
      <pin position="F1" pad="PB06"/>
      <pin position="F2" pad="PB05"/>
      <pin position="F3" pad="VDDANA"/>
      <pin position="F10" pad="PC21"/>
      <pin position="F11" pad="PB16"/>
      <pin position="G1" pad="PB08"/>
      <pin position="G2" pad="PB07"/>
      <pin position="G10" pad="PC19"/>
      <pin position="G11" pad="PC20"/>
      <pin position="H1" pad="PA04"/>
      <pin position="H2" pad="PB09"/>
      <pin position="H3" pad="PA05"/>
      <pin position="H9" pad="PA18"/>
      <pin position="H10" pad="PC17"/>
      <pin position="H11" pad="PC18"/>
      <pin position="J1" pad="PA06"/>
      <pin position="J2" pad="PA07"/>
      <pin position="J3" pad="PC07"/>
      <pin position="J4" pad="PA10"/>
      <pin position="J5" pad="PC09"/>
      <pin position="J8" pad="PC14"/>
      <pin position="J9" pad="PA16"/>
      <pin position="J10" pad="PA19"/>
      <pin position="J11" pad="PC16"/>
      <pin position="K1" pad="PC05"/>
      <pin position="K2" pad="PC06"/>
      <pin position="K3" pad="PA11"/>
      <pin position="K4" pad="PC10"/>
      <pin position="K5" pad="PC12"/>
      <pin position="K6" pad="PB11"/>
      <pin position="K7" pad="PB12"/>
      <pin position="K8" pad="PB14"/>
      <pin position="K9" pad="PA12"/>
      <pin position="K10" pad="PA14"/>
      <pin position="K11" pad="PA17"/>
      <pin position="L1" pad="PA08"/>
      <pin position="L2" pad="PA09"/>
      <pin position="L3" pad="PC08"/>
      <pin position="L4" pad="PC11"/>
      <pin position="L5" pad="PC13"/>
      <pin position="L6" pad="VLCD"/>
      <pin position="L7" pad="PB13"/>
      <pin position="L8" pad="PB15"/>
      <pin position="L9" pad="PC15"/>
      <pin position="L10" pad="PA13"/>
      <pin position="L11" pad="PA15"/>
    </pinout>
    <pinout name="SAML22N" caption="SAML22N">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PC00"/>
      <pin position="4" pad="PC01"/>
      <pin position="5" pad="PC02"/>
      <pin position="6" pad="PC03"/>
      <pin position="7" pad="PA02"/>
      <pin position="8" pad="PA03"/>
      <pin position="9" pad="PB04"/>
      <pin position="10" pad="PB05"/>
      <pin position="11" pad="GNDANA"/>
      <pin position="12" pad="VDDANA"/>
      <pin position="13" pad="PB06"/>
      <pin position="14" pad="PB07"/>
      <pin position="15" pad="PB08"/>
      <pin position="16" pad="PB09"/>
      <pin position="17" pad="PA04"/>
      <pin position="18" pad="PA05"/>
      <pin position="19" pad="PA06"/>
      <pin position="20" pad="PA07"/>
      <pin position="21" pad="PC05"/>
      <pin position="22" pad="PC06"/>
      <pin position="23" pad="PC07"/>
      <pin position="24" pad="GNDANA"/>
      <pin position="25" pad="VDDANA"/>
      <pin position="26" pad="PA08"/>
      <pin position="27" pad="PA09"/>
      <pin position="28" pad="PA10"/>
      <pin position="29" pad="PA11"/>
      <pin position="30" pad="PC08"/>
      <pin position="31" pad="PC09"/>
      <pin position="32" pad="PC10"/>
      <pin position="33" pad="PC11"/>
      <pin position="34" pad="PC12"/>
      <pin position="35" pad="PC13"/>
      <pin position="36" pad="VDDIO"/>
      <pin position="37" pad="GNDIO"/>
      <pin position="38" pad="VLCD"/>
      <pin position="39" pad="PB11"/>
      <pin position="40" pad="PB12"/>
      <pin position="41" pad="PB13"/>
      <pin position="42" pad="PB14"/>
      <pin position="43" pad="PB15"/>
      <pin position="44" pad="PC14"/>
      <pin position="45" pad="PC15"/>
      <pin position="46" pad="PA12"/>
      <pin position="47" pad="PA13"/>
      <pin position="48" pad="PA14"/>
      <pin position="49" pad="PA15"/>
      <pin position="50" pad="GNDIO"/>
      <pin position="51" pad="VDDIO"/>
      <pin position="52" pad="PA16"/>
      <pin position="53" pad="PA17"/>
      <pin position="54" pad="PA18"/>
      <pin position="55" pad="PA19"/>
      <pin position="56" pad="PC16"/>
      <pin position="57" pad="PC17"/>
      <pin position="58" pad="PC18"/>
      <pin position="59" pad="PC19"/>
      <pin position="60" pad="PC20"/>
      <pin position="61" pad="PC21"/>
      <pin position="62" pad="GNDIO"/>
      <pin position="63" pad="VDDIO"/>
      <pin position="64" pad="PB16"/>
      <pin position="65" pad="PB17"/>
      <pin position="66" pad="PB18"/>
      <pin position="67" pad="PB19"/>
      <pin position="68" pad="PB20"/>
      <pin position="69" pad="PB21"/>
      <pin position="70" pad="PA20"/>
      <pin position="71" pad="PA21"/>
      <pin position="72" pad="PA22"/>
      <pin position="73" pad="PA23"/>
      <pin position="74" pad="PA24"/>
      <pin position="75" pad="PA25"/>
      <pin position="76" pad="GNDIO"/>
      <pin position="77" pad="VDDIO"/>
      <pin position="78" pad="PB22"/>
      <pin position="79" pad="PB23"/>
      <pin position="80" pad="PB24"/>
      <pin position="81" pad="PB25"/>
      <pin position="82" pad="PC24"/>
      <pin position="83" pad="PC25"/>
      <pin position="84" pad="PC26"/>
      <pin position="85" pad="PC27"/>
      <pin position="86" pad="PC28"/>
      <pin position="87" pad="PA27"/>
      <pin position="88" pad="RESET_N"/>
      <pin position="89" pad="VDDCORE"/>
      <pin position="90" pad="GNDIO"/>
      <pin position="91" pad="VSW"/>
      <pin position="92" pad="VDDIO"/>
      <pin position="93" pad="PA30"/>
      <pin position="94" pad="PA31"/>
      <pin position="95" pad="PB30"/>
      <pin position="96" pad="PB31"/>
      <pin position="97" pad="PB00"/>
      <pin position="98" pad="PB01"/>
      <pin position="99" pad="PB02"/>
      <pin position="100" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
